<font color='Blue' size=33><b>Biblioteca Pandas</font></b>

**Séries**

In [1]:
import numpy as np
import pandas as pd

In [2]:
etiquetas = ['a', 'b', 'c']
dados = [15, 20, 30]

In [3]:
serie = pd.Series(data=dados, index=etiquetas)
serie

a    15
b    20
c    30
dtype: int64

In [4]:
array = np.arange(3,6)
serie2 = pd.Series(array)
serie2

0    3
1    4
2    5
dtype: int32

In [5]:
dados_index = ['dados1', 'dados2', 'dados3']
serie2 = pd.Series(array, dados_index)
serie2

dados1    3
dados2    4
dados3    5
dtype: int32

In [6]:
serie2['dados2']

4

In [7]:
dicionario = dict({"A": 1, "B": 2, "C": 3, "D": 4, "E": 5})
dados4 = pd.Series(dicionario)
dados4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [8]:
for lista in dados4:
    print(lista)

1
2
3
4
5

In [9]:
info = dados4.index[4]
info

'E'

In [10]:
dados4[info]

5

In [11]:
entrada = "E"
x = 0;


while x < len(dados4):
    info = dados4.index[x]
    if(info == entrada):
        posicao = dados4[info]
    x += 1
posicao

5

**DataFrame**

In [12]:
linhas = ["linha1","linha2", "linha3"]
colunas = ["cluna1","coluna2", "coluna3"]
dados = [[123, 456,789], [444, 555, 666], [555, 777, 888]]

dataframe = pd.DataFrame(dados, linhas, colunas)
dataframe

        cluna1  coluna2  coluna3
linha1     123      456      789
linha2     444      555      666
linha3     555      777      888

In [13]:
dataframe.loc['linha1']

cluna1     123
coluna2    456
coluna3    789
Name: linha1, dtype: int64

In [14]:
info = dataframe.index[0]

In [15]:
lista = np.array(dataframe.loc[info])
lista

array([123, 456, 789], dtype=int64)

In [16]:
entrada = 789
for x in lista:
    if(x == entrada):
        print(x)

789

In [17]:
dataframe.loc['linha3']['coluna2']

777

In [18]:
dataframe['soma total'] = dataframe['cluna1'] + dataframe['coluna2'] + dataframe['coluna3']
dataframe

        cluna1  coluna2  coluna3  soma total
linha1     123      456      789        1368
linha2     444      555      666        1665
linha3     555      777      888        2220

In [19]:
dataframe.drop('soma total', axis=1)

        cluna1  coluna2  coluna3
linha1     123      456      789
linha2     444      555      666
linha3     555      777      888

In [20]:
dataframe

        cluna1  coluna2  coluna3  soma total
linha1     123      456      789        1368
linha2     444      555      666        1665
linha3     555      777      888        2220

In [21]:
dataframe.drop('soma total', axis=1, inplace=True)
dataframe

        cluna1  coluna2  coluna3
linha1     123      456      789
linha2     444      555      666
linha3     555      777      888

**Condição**

In [22]:
dataframe['soma total'] = dataframe['cluna1'] + dataframe['coluna2'] + dataframe['coluna3']
dataframe

        cluna1  coluna2  coluna3  soma total
linha1     123      456      789        1368
linha2     444      555      666        1665
linha3     555      777      888        2220

In [23]:
condicao = dataframe['soma total'] > 2000
condicao

linha1    False
linha2    False
linha3     True
Name: soma total, dtype: bool

In [24]:
dataframe[condicao]

        cluna1  coluna2  coluna3  soma total
linha3     555      777      888        2220

In [25]:
condicao = (dataframe['cluna1']  > 200 ) & (dataframe['coluna3'] < 800 )
condicao

linha1    False
linha2     True
linha3    False
dtype: bool

In [26]:
dataframe[condicao]

        cluna1  coluna2  coluna3  soma total
linha2     444      555      666        1665

In [27]:
dataframe[condicao][['cluna1', 'coluna2']]

        cluna1  coluna2
linha2     444      555

**Modificando o nome das Linha**

In [28]:
nova_linha = 'Dia 1, Dia 2, Dia 3'.split(',')
nova_linha

['Dia 1', ' Dia 2', ' Dia 3']

In [29]:
dataframe['Dias'] = nova_linha
dataframe

        cluna1  coluna2  coluna3  soma total    Dias
linha1     123      456      789        1368   Dia 1
linha2     444      555      666        1665   Dia 2
linha3     555      777      888        2220   Dia 3

In [30]:
dataframe.set_index('Dias')

        cluna1  coluna2  coluna3  soma total
Dias
Dia 1      123      456      789        1368
 Dia 2     444      555      666        1665
 Dia 3     555      777      888        2220

In [31]:
dataframe

        cluna1  coluna2  coluna3  soma total    Dias
linha1     123      456      789        1368   Dia 1
linha2     444      555      666        1665   Dia 2
linha3     555      777      888        2220   Dia 3

In [32]:
dataframe = dataframe.set_index('Dias')

In [33]:
dataframe

        cluna1  coluna2  coluna3  soma total
Dias
Dia 1      123      456      789        1368
 Dia 2     444      555      666        1665
 Dia 3     555      777      888        2220

**Tratamento de Dados e Valores Nulos**

In [34]:
dicionario = {'A':[4, 5, np.nan], 'B':[6, 1, 5], 'C':[np.nan, 4, np.nan]}
dicionario

{'A': [4, 5, nan], 'B': [6, 1, 5], 'C': [nan, 4, nan]}

In [35]:
dataframe = pd.DataFrame(dicionario)
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [36]:
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [37]:
dataframe.dropna(axis=1)

   B
0  6
1  1
2  5

In [38]:
dataframe.fillna(value=0)

     A  B    C
0  4.0  6  0.0
1  5.0  1  4.0
2  0.0  5  0.0

In [39]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [40]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0

**Agrupamento de Dados**

In [41]:
dicionario = {'Dias':['Dia 1', 'Dia 2', 'Dia 1', 'Dia 2', 'Dia 3'], 'Vendedores': ['Pedro', 'Marcelo', 'augusto', 'Ricardo', 'José'],
        'Vendas': [100, 200, 300, 650, 550]}

In [42]:
dicionario

{'Dias': ['Dia 1', 'Dia 2', 'Dia 1', 'Dia 2', 'Dia 3'],
 'Vendedores': ['Pedro', 'Marcelo', 'augusto', 'Ricardo', 'José'],
 'Vendas': [100, 200, 300, 650, 550]}

In [43]:
dataframe = pd.DataFrame(dicionario)
dataframe

    Dias Vendedores  Vendas
0  Dia 1      Pedro     100
1  Dia 2    Marcelo     200
2  Dia 1    augusto     300
3  Dia 2    Ricardo     650
4  Dia 3       José     550

In [44]:
dataframe.groupby('Dias').mean()

       Vendas
Dias
Dia 1     200
Dia 2     425
Dia 3     550

In [45]:
dataframe.groupby('Dias').sum()

       Vendas
Dias
Dia 1     400
Dia 2     850
Dia 3     550

In [46]:
dataframe.groupby('Dias').describe()

      Vendas
       count   mean         std    min    25%    50%    75%    max
Dias
Dia 1    2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0
Dia 2    2.0  425.0  318.198052  200.0  312.5  425.0  537.5  650.0
Dia 3    1.0  550.0         NaN  550.0  550.0  550.0  550.0  550.0

**Combinando DataFrames**

In [47]:
dicionario = {'A':[1,2,3], 'B':[4,5,6,], 'C':[7,8,9]}

In [48]:
dataframe1 = pd.DataFrame(dicionario)
dataframe1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [49]:
dicionario2 = {'A':[1,2,3], 'B':[4,5,6,], 'C':[7,8,9]}

In [50]:
dataframe2 = pd.DataFrame(dicionario2)
dataframe2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [51]:
pd.concat([dataframe1, dataframe2])

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
0  1  4  7
1  2  5  8
2  3  6  9

In [52]:
dataframe4 = pd.concat([dataframe1, dataframe2])

In [53]:
indice = list(range(1,7))
indice

[1, 2, 3, 4, 5, 6]

In [54]:
dataframe4['Registros'] = indice
dataframe4

   A  B  C  Registros
0  1  4  7          1
1  2  5  8          2
2  3  6  9          3
0  1  4  7          4
1  2  5  8          5
2  3  6  9          6

In [55]:
dataframe4 = dataframe4.set_index('Registros')
dataframe4

           A  B  C
Registros
1          1  4  7
2          2  5  8
3          3  6  9
4          1  4  7
5          2  5  8
6          3  6  9

In [56]:
pd.concat([dataframe1, dataframe2])

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
0  1  4  7
1  2  5  8
2  3  6  9

In [57]:
pd.concat([dataframe1, dataframe2], axis=1)

   A  B  C  A  B  C
0  1  4  7  1  4  7
1  2  5  8  2  5  8
2  3  6  9  3  6  9

**Merge de DataFrames**

In [58]:
dicionario = {'A':[1,2,3], 'B':[4,5,6], 'Claves':['c1', 'c2','c3']}

In [59]:
dataframe = pd.DataFrame(dicionario)
dataframe

   A  B Claves
0  1  4     c1
1  2  5     c2
2  3  6     c3

In [60]:
dicionario2 = {'C':[11,12,13], 'D':[14,15,16], 'Claves':['c1', 'c2','c3']}

In [61]:
dataframe2 = pd.DataFrame(dicionario2)
dataframe2

    C   D Claves
0  11  14     c1
1  12  15     c2
2  13  16     c3

In [65]:
data_frame2 = pd.merge(dataframe, dataframe2, on='Claves', )

In [66]:
data_frame2

   A  B Claves   C   D
0  1  4     c1  11  14
1  2  5     c2  12  15
2  3  6     c3  13  16

**Join**

In [68]:
dicionario = {'A':[1,2,3], 'B':[4,5,6]}

In [69]:
df = pd.DataFrame(dicionario, index=['dados1', 'dados2', 'dados3'])
df

        A  B
dados1  1  4
dados2  2  5
dados3  3  6

In [70]:
dicionario2 = {'C':[21,32,33], 'D':[34,35,np.nan]}

In [71]:
df_2 = pd.DataFrame(dicionario2, index=['dados1', 'dados2', 'dados3'])
df_2

         C     D
dados1  21  34.0
dados2  32  35.0
dados3  33   NaN

In [72]:
df.join(df_2)

        A  B   C     D
dados1  1  4  21  34.0
dados2  2  5  32  35.0
dados3  3  6  33   NaN

**Operação com DataFrames**

In [73]:
dicionario = {'A':[21,32,33,21], 'B':[33,35,20,33]}
df = pd.DataFrame(dicionario, index=['D1', 'D2', 'D3', 'D4'])
df

     A   B
D1  21  33
D2  32  35
D3  33  20
D4  21  33

In [74]:
df['A'].unique()

array([21, 32, 33], dtype=int64)

In [75]:
df['A'].nunique()

3

In [76]:
df['A'].value_counts()

21    2
33    1
32    1
Name: A, dtype: int64

In [77]:
def mutiplicar(x):
    return x * 2

In [78]:
df['A'].apply(mutiplicar)

D1    42
D2    64
D3    66
D4    42
Name: A, dtype: int64

In [79]:
df['B'].apply(lambda x: x *2)

D1    66
D2    70
D3    40
D4    66
Name: B, dtype: int64

In [80]:
df.drop('B', axis=1)

     A
D1  21
D2  32
D3  33
D4  21

In [81]:
df.drop('D4')

     A   B
D1  21  33
D2  32  35
D3  33  20

In [82]:
df.columns

Index(['A', 'B'], dtype='object')

In [83]:
df.index

Index(['D1', 'D2', 'D3', 'D4'], dtype='object')

In [84]:
df

     A   B
D1  21  33
D2  32  35
D3  33  20
D4  21  33

In [85]:
df.sort_values('B')

     A   B
D3  33  20
D1  21  33
D4  21  33
D2  32  35

In [86]:
df.sort_values('A')

     A   B
D1  21  33
D4  21  33
D2  32  35
D3  33  20

**Trabalhando com Arquivos**

In [87]:
pwd

'C:\\estudos\\essencial_python\\Bibliotecas'

In [88]:
ls

 O volume na unidade C nÆo tem nome.
 O N£mero de S‚rie do Volume ‚ AAE0-463C

 Pasta de C:\estudos\essencial_python\Bibliotecas

28/08/2019  23:21    <DIR>          .
28/08/2019  23:21    <DIR>          ..
27/08/2019  20:19            59.603 .ipynb
28/08/2019  17:32    <DIR>          .ipynb_checkpoints
28/08/2019  16:13             8.771 dados.xlsx
28/08/2019  18:56           220.159 Matplotlib.ipynb
20/08/2019  23:36            24.240 Numpy.ipynb
28/08/2019  23:21            82.470 Pandas.ipynb
28/08/2019  16:19             5.632 saida.xls
28/08/2019  17:03                22 saida.xlsx
               7 arquivo(s)        400.897 bytes
               3 pasta(s)   39.325.872.128 bytes dispon¡veis

In [89]:
df = pd.read_excel('dados.xlsx')

In [90]:
df

        A       B       C      D
0   33431  100036   45481  83408
1   71010   99772   56643  54851
2   12858   75939   19119  85305
3    7850   13864   57841  61229
4   63528   34788   84481  97367
5   29707   69050   32841  26565
6   18498   53328   94809  37538
7   51941   98334  100334  36277
8   93131   19747   96144   9358
9   35942    2033   70668  15537
10  76075   11427   95844  77053
11  48737   45355   42465  10516
12  75153   84563   28407   8455
13   4384   91781   46191  13899
14  55849   22387   48948  14033
15  76422   72133   58499  46362
16  13102   97151   15122  70838
17  72330   46875   20868   8545
18   1274   75693   56309   9888
19  39556   35330   83712  21349

In [91]:
df.head()

       A       B      C      D
0  33431  100036  45481  83408
1  71010   99772  56643  54851
2  12858   75939  19119  85305
3   7850   13864  57841  61229
4  63528   34788  84481  97367

In [92]:
lista = list(range(1,21))
lista

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [93]:
df = df['E'] = lista

TypeError: list indices must be integers or slices, not str

In [94]:
df

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [96]:
df.to_excel('sai.xls', sheet_name='hoje')

AttributeError: 'list' object has no attribute 'to_excel'

**Ler Páginas HTML**

In [97]:
pagina_web = 'https://agenciadenoticias.ibge.gov.br/agencia-sala-de-imprensa/2013-agencia-de-noticias/releases/25278-ibge-divulga-as-estimativas-da-populacao-dos-municipios-para-2019'

In [98]:
dados = pd.read_html(pagina_web)

In [99]:
dataframe = dados[0]

In [100]:
dataframe.head(10)

  MUNICÍPIOS COM MAIS DE 1 MILHÃO DE HABITANTES                      \
                                          ORDEM  UF       MUNICÍPIO
0                                            1º  SP       São Paulo
1                                            2º  RJ  Rio de Janeiro
2                                            3º  DF        Brasília
3                                            4º  BA        Salvador
4                                            5º  CE       Fortaleza
5                                            6º  MG  Belo Horizonte
6                                            7º  AM          Manaus
7                                            8º  PR        Curitiba
8                                            9º  PE          Recife
9                                           10º  GO         Goiânia


  POPULAÇÃO 2019
0     12.252.023
1      6.718.903
2      3.015.268
3      2.872.347
4      2.669.342
5      2.512.070
6      2.182.763
7      1.933.105
8      1.645.727
9      1.516.113

In [102]:
dataframe = dados[1]
dataframe.head(10)

  OS MUNICÍPIOS COM MAIS DE 500 MIL HABITANTES, EXCETO CAPITAIS      \
                                                          ORDEM  UF
0                                                 1º             SP
1                                                 2º             SP
2                                                 3º             RJ
3                                                 4º             RJ
4                                                 5º             SP
5                                                 6º             RJ
6                                                 7º             SP
7                                                 8º             SP
8                                                 9º             SP
9                                                10º             PE


                 MUNICÍPIO POPULAÇÃO 2019
0                Guarulhos      1.379.182
1                 Campinas      1.204.073
2              São Gonçalo      1.084.839
3          Duque de Caxias        919.596
4    São Bernardo do Campo        838.936
5              Nova Iguaçu        821.128
6      São José dos Campos        721.944
7              Santo André        718.773
8           Ribeirão Preto        703.293
9  Jaboatão dos Guararapes        702.298

**Transformando DataFrame em SQL**

**Trabalhando Com Gráficos**

In [ ]:
df = pd.DataFrame(np.random.randint(200, size=(50,4)), columns=['A', 'B', 'C', 'D'])

In [ ]:
df.head()

In [ ]:
df["B"].hist()

In [ ]:
df["B"].hist(bins=30)

In [ ]:
df['A'].plot.hist()

In [ ]:
df.plot.area()

In [ ]:
df.plot.area(alpha=0.3)

In [ ]:
df.plot.bar()

In [ ]:
df.plot.bar(stacked=True)

In [ ]:
df.plot.scatter(x='A', y='B')

In [ ]:
df.plot.scatter(x='A', y='B', c='C')

In [ ]:
df.plot.scatter(x='A', y='B', c='C', cmap='coolwarm')

In [ ]:
df.plot.box()

In [ ]:
df.plot.hexbin(x='A', y='B', gridsize=12)

In [ ]:
df.plot.kde()

In [ ]:
df.plot.density()